bibliography.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Bibliography: Type class laws and equational reasoning</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Bibliography: Type class laws and equational reasoning"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-03-24T22:29+0100"/>
<meta name="author" content="Lukas Hofmaier"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Bibliography: Type class laws and equational reasoning</h1>

<p>Diesen Blogpost moechte ich gerne verstehen. Der Post ist der Grund, weshalb ich das Thema gewaehlt habe: <a href="http://www.haskellforall.com/2014/07/equational-reasoning-at-scale.html">Equational reasoning at scale</a>
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Type class laws</h2>
<div class="outline-text-2" id="text-1">

<dl>
<dt>The Typeclassopedia</dt><dd>Brent Yorgey, The monad reader, Issue 13. Artikel ueber Type classes des Haskell Standard. Zu jeder Type class werden auch Laws beschrieben. <a href="https://wiki.haskell.org/wikiupload/8/85/TMR-Issue13.pdf">The monad reader issue 13</a>
</dd>
<dt>Category design pattern</dt><dd><a href="http://www.haskellforall.com/2012/08/the-category-design-pattern.html">haskellforall Blogpost</a>
</dd>
<dt>Functor design pattern</dt><dd><a href="http://www.haskellforall.com/2012/09/the-functor-design-pattern.html">haskellforall Blogpost</a>
</dd>
</dl>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Equational reasoning</h2>
<div class="outline-text-2" id="text-2">

<dl>
<dt>Programming in Haskell</dt><dd>Graham Hutton, Cambridge University Press, Chapter 13 Reasoning about programs. Kapitel 13 gibt eine Einfuehrung in Equational Reasoning mit einem Beispiel.
</dd>
<dt>Haskell: The Craft of Functional Programming</dt><dd>Thompson Simon, Addison-Wesley. Erklaert Equational Reasoning und Type classes.
</dd>
<dt>The Haskell road to logic, maths and programming</dt><dd>Enthaelt Kapitel ueber Proofs von Properties 
</dd>
<dt>Equation Reasoning</dt><dd><a href="http://www.haskellforall.com/2013/12/equational-reasoning.html">haskellforall Blogpost</a>
</dd>
</dl>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Pipes</h2>
<div class="outline-text-2" id="text-3">

<dl>
<dt>Pipes Tutorial</dt><dd><a href="http://hackage.haskell.org/package/pipes-4.1.0/docs/Pipes-Tutorial.html">Pipes Tutorial</a>
</dd>
</dl>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-03-24T22:29+0100</p>
<p class="author">Author: Lukas Hofmaier</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
